{"class_name": "Model", "config": {"name": "Model_3xTPA", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 32, 32, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "TPA121_input"}, "name": "TPA121_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 32, 32, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "TPA122_input"}, "name": "TPA122_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 32, 32, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "TPA123_input"}, "name": "TPA123_input", "inbound_nodes": []}, {"class_name": "TimeDistributed", "config": {"name": "TPA121_b1c1", "trainable": true, "dtype": "float32", "layer": {"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "name": "TPA121_b1c1", "inbound_nodes": [[["TPA121_input", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "TPA122_b1c1", "trainable": true, "dtype": "float32", "layer": {"class_name": "Conv2D", "config": {"name": "conv2d_6", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "name": "TPA122_b1c1", "inbound_nodes": [[["TPA122_input", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "TPA123_b1c1", "trainable": true, "dtype": "float32", "layer": {"class_name": "Conv2D", "config": {"name": "conv2d_12", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "name": "TPA123_b1c1", "inbound_nodes": [[["TPA123_input", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "TPA121_b1c2", "trainable": true, "dtype": "float32", "layer": {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "name": "TPA121_b1c2", "inbound_nodes": [[["TPA121_b1c1", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "TPA122_b1c2", "trainable": true, "dtype": "float32", "layer": {"class_name": "Conv2D", "config": {"name": "conv2d_7", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "name": "TPA122_b1c2", "inbound_nodes": [[["TPA122_b1c1", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "TPA123_b1c2", "trainable": true, "dtype": "float32", "layer": {"class_name": "Conv2D", "config": {"name": "conv2d_13", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "name": "TPA123_b1c2", "inbound_nodes": [[["TPA123_b1c1", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "TPA121_b1c3", "trainable": true, "dtype": "float32", "layer": {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "name": "TPA121_b1c3", "inbound_nodes": [[["TPA121_b1c2", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "TPA122_b1c3", "trainable": true, "dtype": "float32", "layer": {"class_name": "Conv2D", "config": {"name": "conv2d_8", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "name": "TPA122_b1c3", "inbound_nodes": [[["TPA122_b1c2", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "TPA123_b1c3", "trainable": true, "dtype": "float32", "layer": {"class_name": "Conv2D", "config": {"name": "conv2d_14", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "name": "TPA123_b1c3", "inbound_nodes": [[["TPA123_b1c2", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "TPA121_b2m1", "trainable": true, "dtype": "float32", "layer": {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}}, "name": "TPA121_b2m1", "inbound_nodes": [[["TPA121_b1c3", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "TPA122_b2m1", "trainable": true, "dtype": "float32", "layer": {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}}, "name": "TPA122_b2m1", "inbound_nodes": [[["TPA122_b1c3", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "TPA123_b2m1", "trainable": true, "dtype": "float32", "layer": {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_4", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}}, "name": "TPA123_b2m1", "inbound_nodes": [[["TPA123_b1c3", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "TPA121_b2c1", "trainable": true, "dtype": "float32", "layer": {"class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "name": "TPA121_b2c1", "inbound_nodes": [[["TPA121_b2m1", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "TPA122_b2c1", "trainable": true, "dtype": "float32", "layer": {"class_name": "Conv2D", "config": {"name": "conv2d_9", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "name": "TPA122_b2c1", "inbound_nodes": [[["TPA122_b2m1", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "TPA123_b2c1", "trainable": true, "dtype": "float32", "layer": {"class_name": "Conv2D", "config": {"name": "conv2d_15", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "name": "TPA123_b2c1", "inbound_nodes": [[["TPA123_b2m1", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "TPA121_b2c2", "trainable": true, "dtype": "float32", "layer": {"class_name": "Conv2D", "config": {"name": "conv2d_4", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "name": "TPA121_b2c2", "inbound_nodes": [[["TPA121_b2c1", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "TPA122_b2c2", "trainable": true, "dtype": "float32", "layer": {"class_name": "Conv2D", "config": {"name": "conv2d_10", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "name": "TPA122_b2c2", "inbound_nodes": [[["TPA122_b2c1", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "TPA123_b2c2", "trainable": true, "dtype": "float32", "layer": {"class_name": "Conv2D", "config": {"name": "conv2d_16", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "name": "TPA123_b2c2", "inbound_nodes": [[["TPA123_b2c1", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "TPA121_b2c3", "trainable": true, "dtype": "float32", "layer": {"class_name": "Conv2D", "config": {"name": "conv2d_5", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "name": "TPA121_b2c3", "inbound_nodes": [[["TPA121_b2c2", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "TPA122_b2c3", "trainable": true, "dtype": "float32", "layer": {"class_name": "Conv2D", "config": {"name": "conv2d_11", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "name": "TPA122_b2c3", "inbound_nodes": [[["TPA122_b2c2", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "TPA123_b2c3", "trainable": true, "dtype": "float32", "layer": {"class_name": "Conv2D", "config": {"name": "conv2d_17", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "name": "TPA123_b2c3", "inbound_nodes": [[["TPA123_b2c2", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "TPA121_b3m1", "trainable": true, "dtype": "float32", "layer": {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}}, "name": "TPA121_b3m1", "inbound_nodes": [[["TPA121_b2c3", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "TPA122_b3m1", "trainable": true, "dtype": "float32", "layer": {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}}, "name": "TPA122_b3m1", "inbound_nodes": [[["TPA122_b2c3", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "TPA123_b3m1", "trainable": true, "dtype": "float32", "layer": {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_5", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}}, "name": "TPA123_b3m1", "inbound_nodes": [[["TPA123_b2c3", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "TPA121_flat", "trainable": true, "dtype": "float32", "layer": {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}}, "name": "TPA121_flat", "inbound_nodes": [[["TPA121_b3m1", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "TPA122_flat", "trainable": true, "dtype": "float32", "layer": {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}}, "name": "TPA122_flat", "inbound_nodes": [[["TPA122_b3m1", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "TPA123_flat", "trainable": true, "dtype": "float32", "layer": {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}}, "name": "TPA123_flat", "inbound_nodes": [[["TPA123_b3m1", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "TPA121_dense", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 341, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "name": "TPA121_dense", "inbound_nodes": [[["TPA121_flat", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "TPA122_dense", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 341, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "name": "TPA122_dense", "inbound_nodes": [[["TPA122_flat", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "TPA123_dense", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 341, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "name": "TPA123_dense", "inbound_nodes": [[["TPA123_flat", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "view_concat", "trainable": true, "dtype": "float32", "axis": -1}, "name": "view_concat", "inbound_nodes": [[["TPA121_dense", 0, 0, {}], ["TPA122_dense", 0, 0, {}], ["TPA123_dense", 0, 0, {}]]]}, {"class_name": "GRU", "config": {"name": "TPA_GRU", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 1023, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2, "reset_after": true}, "name": "TPA_GRU", "inbound_nodes": [[["view_concat", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "TPA_dense", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 2, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "name": "TPA_dense", "inbound_nodes": [[["TPA_GRU", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "TPA_classification", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "TPA_classification", "inbound_nodes": [[["TPA_dense", 0, 0, {}]]]}], "input_layers": [["TPA121_input", 0, 0], ["TPA122_input", 0, 0], ["TPA123_input", 0, 0]], "output_layers": [["TPA_classification", 0, 0]]}, "keras_version": "2.3.0-tf", "backend": "tensorflow"}